---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PointRelativeOutside
source: html/63d85894-0e5d-11b0-7cda-b570b7e447e6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PointRelativeOutside Property

In order to place Points relative to the existing Surface, the Point must be placed within the area of the existing Surface. The height of the new Point will be relative to the current Surface elevation at that Point.

## Syntax (C#)
```csharp
public static FailureDefinitionId PointRelativeOutside { get; }
```